[
  {
    "id": 1,
    "url": "https://www.glassdoor.ca/job-listing/full-stack-web-developer-netsyde-systems-JV_KO0,24_KE25,40.htm?jl=1009173107467&utm_source=jobalert&utm_medium=email&utm_content=ja-jobpos5-1009173107467&utm_campaign=jobAlertAlert&tgt=GD_JOB_VIEW&src=GD_JOB_AD&uido=04BF741886F96CAEC9E89195E612EB0E&ao=1136043&jrtk=5-yul1-0-1hobjpe8djqss800-948c1dbd33658baa&cs=1_d2dade39&s=224&t=JA&pos=105&ja=282255805&guid=0000018e17330b8e867bcd032ca8d8b5&jobListingId=1009173107467&ea=1&vt=e&cb=1709786839480&ctt=1709811950864&srs=EMAIL_JOB_ALERT",
    "company": "Netsyde Systems",
    "role": "Full Stack Web Developer",
    "description": "<div class='JobDetails_jobDescription__uW_fK JobDetails_showHidden__C_FOA' data-brandviews='PAGE:n=jobview-page:eid=0:jlid=1009173107467'><p><b>Full Stack Web Developer</b></p><p><b>About Us</b></p><p>Netsyde Systems is a small software development company currently supporting multiple web applications for several client organizations. We enhance and maintain existing legacy applications, as well as design and build custom greenfield systems.</p><p>We are seeking an Intermediate Full Stack Web Developer for a 12 Month Contract (Remote).</p><p>Note: the opportunity exists for the contract to transition into a full-time position if the fit is right and further projects become available in 2025.</p><p><b>About You</b></p><p>We are looking for an experienced, resourceful, and detail-oriented quick learner. You are able to convert technical specs and business requirements documents into clear, concise, and intuitive code. In your hands bugs are found and fixed quickly, and features are implemented elegantly. You work and learn well independently; grasping new code and techniques comes naturally.</p><p>Some general maxims in which you may or may not believe (but are able to either support or disavow):</p><ul><li>Good code does not necessarily require comments to be legible.</li><li>Functional map/reduce techniques are typically better than temp variables and explicit loops.</li><li>Business logic usually doesn’t belong in the database, and ORMs are preferable to raw SQL.</li><li>TypeScript &amp; LINQ are two of the best things to have come from Microsoft’s stable of technologies.</li></ul><p><b>About the Position</b></p><p>A diverse and challenging range of work awaits the successful applicant, from enhancing and maintaining older ASP.NET projects, to the development of new MVC, API, and Single Page Apps. You will have your hands in the entire stack, from the database, through the server, right to the client's browser, and will have the opportunity to design and improve various systems throughout.</p><p>Brief daily scrums are held daily on weekdays, where questions can be asked, problems addressed, and directions received. Text chat availability windows are agreed upon, during which further communication can happen in real time and additional meetings arranged if necessary. Outside of that, you are free to choose your own schedule, and expected to log approximately 40 hours weekly.</p><p>You are proficient with the following technologies:</p><p>Backend:</p><ul><li>MS T-SQL</li><li>C#</li><li>ASP.NET (MVC &amp; Razor Pages)</li><li>LINQ to Entities</li></ul><p>Frontend:</p><ul><li>TypeScript</li><li>JavaScript</li><li>React</li><li>HTML</li><li>CSS</li></ul><p>Tooling:</p><ul><li>Visual Studio</li><li>Git</li><li>Node.js &amp; npm</li></ul><p>Bonus Skills:</p><p>LAMP stack experience is welcome but not required.</p><p><b>About Applying</b></p><p>Please respond to this posting with your resume, a link to a code repository with some recent work, and salary expectations. Candidates that are a potential fit will be contacted for a phone interview, and subsequently assigned a take-home technical assessment.</p><p>Thanks in advance for your interest.</p><p>Job Types: Full-time, Fixed term contract<br>Contract length: 12 months</p><p>Salary: $30.00-$45.00 per hour</p><p>Expected hours: 35 – 40 per week</p><p>Benefits:</p><ul><li>Flexible schedule</li><li>Work from home</li></ul><p>Flexible Language Requirement:</p><ul><li>French not required</li></ul><p>Work Location: Remote</p><p>Application deadline: 2024-03-15</p></div>",
    "location": "remote",
    "datePosted": ""
  }
]
